# IExporterIFC Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExporterIFC Interface
Members See Also
---
The interface used to implement a custom IFC exporter.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public interface IExporterIFC : IExternalServer
```

Visual Basic
---
```text
Public Interface IExporterIFC _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IExporterIFC : IExternalServer
```

# Remarks
Implement this interface and register an instance of the derived class with ExporterIFCRegistry.
# See Also
IExporterIFC Members
Autodesk.Revit.DB.IFC Namespace